# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/osu050/osu05_stdcells.lib
read_verilog  /home/mounir/Desktop/proc_9/source/processor_9_bits.v

# High-level synthesis
synth -top processor_9_bits
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/osu050/osu05_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/osu050/osu05_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
# Output buffering
iopadmap -outpad BUFX2 A:Y -bits
# Cleanup
opt
clean
rename -enumerate
write_verilog  processor_9_bits_mapped.v
stat
